select * from HocVien

INSERT INTO HOCVIEN (code, ten, sdt, ngaySinh, gioiTinh, avatarUrl, tag, ghiChu, thoiGianTao, thoiGianSua, ngayXoa)
VALUES
('HV001', N'Nguyễn Văn A', '0912345678', '2000-01-15', 1, NULL, 1, N'Học viên chăm chỉ', '2023-01-01', '2023-01-10', '2099-12-31'),
('HV002', N'Trần Thị B', '0987654321', '1999-05-20', 0, NULL, 2, N'Quan tâm đến lớp online', '2023-01-02', '2023-01-12', '2099-12-31'),
('HV003', N'Lê Văn C', '0905123456', '2001-03-10', 1, NULL, 1, N'Chưa xác định khóa học', '2023-01-03', '2023-01-15', '2099-12-31'),
('HV004', N'Phạm Thị D', '0932123456', '2002-08-09', 0, NULL, 3, N'Học viên năng động', '2023-01-05', '2023-01-18', '2099-12-31'),
('HV005', N'Võ Minh E', '0978543210', '1998-12-12', 1, NULL, 2, N'Học viên offline', '2023-01-06', '2023-01-20', '2099-12-31'),
('HV006', N'Ngô Thị F', '0918765432', '2000-07-25', 0, NULL, 1, N'Học viên mới đăng ký', '2023-01-08', '2023-01-22', '2099-12-31'),
('HV007', N'Huỳnh Văn G', '0909988776', '2003-09-01', 1, NULL, 2, N'Học viên ưu tú', '2023-01-10', '2023-01-25', '2099-12-31'),
('HV008', N'Lý Thị H', '0944332211', '1999-02-18', 0, NULL, 3, N'Học viên xuất sắc', '2023-01-12', '2023-01-27', '2099-12-31'),
('HV009', N'Phan Văn I', '0933445566', '2001-10-30', 1, NULL, 1, N'Tham gia lớp kỹ năng mềm', '2023-01-15', '2023-01-28', '2099-12-31'),
('HV010', N'Trương Thị K', '0977665544', '2000-11-21', 0, NULL, 2, N'Có tiềm năng phát triển', '2023-01-18', '2023-02-01', '2099-12-31'),
('HV011', N'Nguyễn Thành L', '0901345798', '1998-04-04', 1, NULL, 3, N'Học viên cũ quay lại', '2023-01-20', '2023-02-03', '2099-12-31'),
('HV012', N'Đỗ Thị M', '0912987654', '2002-12-28', 0, NULL, 1, N'Học viên tích cực', '2023-01-22', '2023-02-05', '2099-12-31'),
('HV013', N'Bùi Văn N', '0934567812', '2001-06-15', 1, NULL, 2, N'Học viên chuyên ngành CNTT', '2023-01-25', '2023-02-06', '2099-12-31'),
('HV014', N'Tạ Thị O', '0923456789', '2003-01-03', 0, NULL, 3, N'Yêu cầu học thêm kỹ năng mềm', '2023-01-28', '2023-02-10', '2099-12-31'),
('HV015', N'Đặng Văn P', '0981122334', '2000-05-09', 1, NULL, 2, N'Học viên có năng khiếu', '2023-01-30', '2023-02-12', '2099-12-31'),
('HV016', N'Phùng Thị Q', '0977001122', '1999-07-17', 0, NULL, 1, N'Học viên trung bình', '2023-02-02', '2023-02-15', '2099-12-31'),
('HV017', N'Trần Văn R', '0966554433', '2001-09-22', 1, NULL, 2, N'Học viên cần hỗ trợ', '2023-02-05', '2023-02-17', '2099-12-31'),
('HV018', N'Lưu Thị S', '0944112233', '2002-11-19', 0, NULL, 3, N'Học viên lớp trực tuyến', '2023-02-07', '2023-02-20', '2099-12-31'),
('HV019', N'Đoàn Văn T', '0933778899', '2000-08-08', 1, NULL, 1, N'Học viên mới chuyển đến', '2023-02-10', '2023-02-22', '2099-12-31'),
('HV020', N'Vũ Thị U', '0911556677', '1999-10-25', 0, NULL, 2, N'Học viên có thái độ tốt', '2023-02-12', '2023-02-25', '2099-12-31');
